cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/fonts'

brew 'ack'
brew 'ag'
brew 'automake'
brew 'autoconf'
brew 'coreutils'
brew 'curl'
brew 'fd'
brew 'fpp'
brew 'git'
brew 'gpg'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'nmap'
brew 'openssl'
brew 'overmind'
brew 'readline'
brew 'puma/puma/puma-dev'
brew 'reattach-to-user-namespace'
brew 'roundup'
brew 's-search'
brew 'spaceman-diff'
brew 'spark'
brew 'tig'
brew 'tree'
brew 'unixodbc'
brew 'unrar'
brew 'unzip'
brew 'vim'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'

cask '1password'
cask 'boostnote'
cask 'chromedriver'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'kap'
cask 'keepingyouawake'
cask 'ngrok'
cask 'postman'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'teamviewer'
cask 'tunnelbear'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'wkhtmltopdf'
