tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'anybar'
cask 'iterm2'
cask 'java'
cask 'font-dosis'
cask 'font-lato'
cask 'font-yanone-kaffeesatz'
cask 'font-quicksand'
cask 'font-source-sans-pro'
cask 'font-source-code-pro'
cask 'font-sniglet'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'karabiner-elements'                        # remapping keys for my ergo keyboard
cask 'kap'                                       # capture screen as gif
cask 'keepingyouawake'                           # prevent mac from sleeping
cask 'muzzle'                                    # block all notifications
cask 'ngrok'                                     # local server
cask 'spectacle'                                 # window management
brew 'archey'                                    # colorful system information
brew 'cmake'
brew 'chromedriver', restart_service: false
brew 'graphviz'                                  # To build ERD diagrams
brew 'openssl'
brew 'erlang'
brew 'elixir'
brew 'exercism'
brew 'git'
brew 'fzf'
brew 'ffmpeg'
brew 'thefuck'
brew 'tmux'
brew 'highlight'                                 # Syntax highlight code snippets
brew 'imagemagick'
brew 'overmind'                                  # Process manager (Procfile based)
brew 'pstree'                                    # ausxf for macOS
brew 'readline'
brew 'sqlite'
brew 'shellcheck'                                # Linter for shell scripts
brew 'python'
brew 'go'
brew 'heroku'
brew 'lua'
brew 'memcached', restart_service: true
brew 'node'
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
brew 'ruby-build'
brew 'ruby'
brew 'rbenv'
brew 'rsync'
brew 'the_silver_searcher'
brew 'tree'
brew 'vim'
brew 'vips'                                      # Fast image processing
brew 'wrk'                                       # Simple web app benchmarking
brew 'yarn'
brew 'zsh'
