tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# apps
cask 'anybar'             # menu bar info
cask 'flux'
cask 'spectacle'          # window management
cask 'karabiner-elements' # keyboard mappings
cask 'nextcloud'

cask 'chromedriver'
cask 'iterm2'

cask 'appcleaner'
cask 'keepassx'
cask 'firefox'
cask 'kap'
cask 'libreoffice'
cask 'slack'

cask 'spotify'
cask 'spotify-notifications'
cask 'vlc'

# fonts
cask 'font-dosis'
cask 'font-lato'
cask 'font-yanone-kaffeesatz'
cask 'font-quicksand'
cask 'font-sniglet'

# Unix tools
brew 'coreutils'           # GNU file, shell and text utilities
brew 'gpg'                 # GNU privacy packages
brew 'neofetch'            # colorful system information
brew 'openssl'
brew 'readline'
brew 'watch'               # execute command periodically
brew 'wget'
brew 'rsync'

# dev tools
brew 'fzf'
brew 'thefuck'
brew 'tmux'
brew 'reattach-to-user-namespace' # fix tmux for macOS
brew 'the_silver_searcher'        # the Ag search tool
brew 'overmind'                   # Process manager (Procfile based)
brew 'sqlite'
brew 'shellcheck'                 # Linter for shell scripts
brew 'python'
brew 'git'
brew 'neovim'
brew 'yarn'
brew 'zsh'

# postgres / postgis dependencies
brew 'geos'
brew 'proj'
brew 'gdal'
brew 'libxml2'
brew 'json-c'

# services
brew 'memcached', restart_service: true
brew 'redis', restart_service: true
