# frozen_string_literal: true

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# Required to install `wxmac@3.1.5`. Remove these extra
# formulae as soon `wxmac@3.2` is released.
# http://www.wxwidgets.org/
# https://github.com/Homebrew/homebrew-core/blob/master/Formula/wxmac.rb
tap 'dominicletz/homebrew-extra'

# code apps
cask 'firefox'
cask 'iterm2'
cask 'rectangle'          # window management
cask 'flycut'             # clipboard manager with history

# dev apps
cask 'chromedriver'
cask 'docker'
cask 'google-cloud-sdk'
# cask 'google-chrome'
cask 'insomnia'           # postman alternative
cask 'visual-studio-code'

# other apps
# cask '1password'
cask 'imageoptim'         # remove exif-data from images
cask 'keepingyouawake'
# cask 'slack'
cask 'spotify'
cask 'vnc-viewer'
cask 'vlc'
cask 'zoom'

# fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-dosis'
cask 'font-quicksand'

# packages
brew 'autoconf'            # for installing erlang
brew 'coreutils'           # GNU file, shell and text utilities
brew 'gpg'                 # GNU privacy packages
brew 'htop'
brew 'btop'                # htop alternative https://github.com/aristocratos/btop
brew 'nmap'                # Network Mapper - network discovery and security auditing
brew 'openssl'
brew 'p7zip'               # Required for Elixir Burrito projects (https://github.com/burrito-elixir/burrito)
brew 'readline'
brew 'rsync'
brew 'slides'              # Slides in your terminal from markdown files (https://maaslalani.com/slides/)
brew 'tree'
brew 'watch'               # execute command periodically
brew 'wget'
brew 'wxmac@3.1.5'         # for starting erlang observer / debugger (OTP 24)

# dev packages
brew 'ansible'
brew 'cmake'
brew 'duf'                        # du (disk usage) alternative
brew 'fd'                         # faster alternative fo `find`
brew 'fzf'                        # command line fuzzy finder
brew 'git'
brew 'git-lfs'                    # Git extension for versioning large files
brew 'git-quick-stats'            # git repo stats
brew 'gh'                         # Github CLI
brew 'flyctl'                     # fly.io CLI
brew 'hadolint'                   # lint dockerfiles
brew 'highlight'                  # utility for converting code to rtf
brew 'jq'                         # format JSON
brew 'k9s'                        # Kubernetes CLI tool
brew 'overmind'                   # Process manager (Procfile based)
brew 'ripgrep'                    # search tool
brew 'shellcheck'                 # Linter for shell scripts
brew 'telnet'
brew 'tmux'
brew 'watchman'                   # for filewatchers
brew 'yarn'                       # run with --ignore-engines if incompatible with node version
brew 'zsh'

# postgis packages
brew 'geos'
brew 'json-c'
brew 'proj'
