# frozen_string_literal: true

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'pmeinhardt/tools'

# apps
cask 'anybar'             # menu bar info
cask 'flux'
cask 'rectangle'          # window management
cask 'karabiner-elements' # keyboard mappings
cask 'nextcloud'
cask 'whatsapp'
cask 'signal'
cask 'telegram'

cask 'chromedriver'
cask 'google-chrome'
cask 'iterm2'
cask 'atom'
cask 'java'
cask 'insomnia'           # postman alternative
cask 'docker'

cask 'keepassx'
cask 'buttercup'          # password manager
cask 'firefox'
cask 'kap'                # record screencasts
cask 'libreoffice'
cask 'slack'
cask 'drawio'
cask '1password'
cask 'gimp'
cask 'inkscape'
cask 'imageoptim'         # remove exif-data from images
cask 'bitbar'             # run scripts in menu bar

cask 'spotify'
cask 'vlc'

# fonts
cask 'font-dosis'
cask 'font-lato'
cask 'font-quicksand'
cask 'font-source-sans-pro'

# Unix tools
brew 'coreutils'           # GNU file, shell and text utilities
brew 'gpg'                 # GNU privacy packages
brew 'neofetch'            # colorful system information
brew 'openssl'
brew 'readline'
brew 'watch'               # execute command periodically
brew 'wget'
brew 'rsync'
brew 'autoconf'            # for installing erlang
brew 'wxmac'               # for starting erlang observer / debugger

# dev tools
brew 'fzf'
brew 'tmux'
brew 'reattach-to-user-namespace' # fix tmux for macOS
brew 'the_silver_searcher'        # the Ag search tool
brew 'overmind'                   # Process manager (Procfile based)
brew 'sqlite'
brew 'shellcheck'                 # Linter for shell scripts
brew 'python'
brew 'git'
brew 'neovim'
brew 'zsh'
brew 'htop'
brew 'fd'
brew 'ansible'
brew 'jq'                         # format JSON
brew 'watchman'                   # for filewatchers
brew 'yarn'                       # run with --ignore-engines if incompatible with node version
brew 'hadolint'                   # lint dockerfiles
brew 'exercism'                   # CLI for exercism.io
brew 'poetry'                     # python package manager
brew 'pyenv'                      # python version manager

# work related tools
brew 'pmeinhardt/tools/hmm', args: ['HEAD']

# postgres / postgis dependencies
brew 'geos'
brew 'proj'
brew 'gdal'
brew 'libxml2'
brew 'json-c'

# services
brew 'memcached', restart_service: true
brew 'redis', restart_service: true
