# frozen_string_literal: true

tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# code apps
cask 'firefox'
cask 'iterm2'
cask 'alacritty'          # A cross-platform, OpenGL terminal emulator
cask 'rectangle'          # window management
cask  'claude'            # Anthropic's official Claude AI desktop app

# dev apps
cask 'chromedriver'
cask 'docker'
cask 'google-chrome'
cask 'insomnia'           # postman alternative
cask 'pgadmin4'           # Postgres interface
cask 'visual-studio-code'
cask 'wireshark'          # inspect network traffic
cask 'zed'                # Trying out zed, alternative editor https://zed.dev

# other apps
cask '1password'
cask 'betterdisplay'      # great app to control and adjust external monitors https://github.com/waydabber/BetterDisplay
cask 'imageoptim'         # remove exif-data from images
cask 'keepingyouawake'
cask 'logi-options-plus'
cask 'obsidian'           # private and flexible note‑taking app https://obsidian.md/
# cask 'slack'
cask 'spotify'
cask 'vnc-viewer'
cask 'vlc'
# cask 'zoom'

# fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-dosis'
cask 'font-quicksand'

# packages
brew 'autoconf'            # for installing erlang
brew 'coreutils'           # GNU file, shell and text utilities
brew 'gpg'                 # GNU privacy packages
brew 'htop'
brew 'btop'                # htop alternative https://github.com/aristocratos/btop
brew 'nmap'                # Network Mapper - network discovery and security auditing
brew 'eza'                 # ls alternative https://eza.rocks/
brew 'openssl'
brew 'p7zip'               # Required for Elixir Burrito projects (https://github.com/burrito-elixir/burrito)
brew 'readline'
brew 'rsync'
brew 'slides'              # Slides in your terminal from markdown files (https://maaslalani.com/slides/)
brew 'tree'
brew 'watch'               # execute command periodically
brew 'wget'
brew 'wxwidgets'           # needed for erlang observer https://www.wxwidgets.org/
brew 'zoxide'              # smarter cd command (https://github.com/ajeetdsouza/zoxide), it relies on `fzf`

# dev packages
brew 'ansible'
brew 'atuin'                      # Alternative to `shell history+fzf` https://github.com/atuinsh/atuin
brew 'awscli'                     # AWS cli
brew 'bat'                        # cat alternative with syntax highlighting
brew 'cmake'
brew 'duf'                        # du (disk usage) alternative
brew 'dvc'                        # Tool for data science https://dvc.org/doc
brew 'fish'                       # Fish shell (alternative to zsh) https://github.com/fish-shell/fish-shell
brew 'fisher'                     # A plugin manager for fisher https://github.com/jorgebucaran/fisher
brew 'fd'                         # faster alternative fo `find`
brew 'fzf'                        # command line fuzzy finder
brew 'git'
brew 'git-lfs'                    # Git extension for versioning large files
brew 'git-quick-stats'            # git repo stats
brew 'gh'                         # Github CLI
brew 'graphviz'                   # Graph visualization tool
brew 'flyctl'                     # fly.io CLI
brew 'hadolint'                   # lint dockerfiles
brew 'highlight'                  # utility for converting code to rtf
brew 'jq'                         # format JSON
brew 'libomp'                     # LLVM's OpenMP runtime library
brew 'libpq'                      # psql - Interface to PostgreSQL
brew 'kubectl'                    # Kubernetes CLI
brew 'k9s'                        # Kubernetes CLI UI
brew 'mise'                       # Package manager, alternative to asdf (no need to activate it when installed via Brew - https://mise.jdx.dev/getting-started.html#shells)
brew 'neovim'                     # Popular vim alternative
brew 'overmind'                   # Process manager (Procfile based)
brew 'ripgrep'                    # search tool
brew 'rustup-init'                # Rustup
brew 'shellcheck'                 # Linter for shell scripts
brew 'starship'                   # Cross-shell customizable prompt (https://starship.rs/)
brew 'telnet'
brew 'tmux'
brew 'watchman'                   # for filewatchers
brew 'yarn'                       # run with --ignore-engines if incompatible with node version
brew 'zsh'                        # Z shell (alternative to Bash)
